/*************************************************************************
                             All Rights Reserved
                                 R&D Dept.
*************************************************************************/


/*************************************************************************

Filename:       damd_porting_io.h

Description:    遥控器及面板控制函数

Author:

Date:

Modify Log:
 ------------------------------------------------------------------------
1.
 修改人  :
 修改时间:
 修改原因:
 修改方法:
 ------------------------------------------------------------------------
2.
 修改人  :
 修改时间:
 修改原因:
 修改方法:
 ------------------------------------------------------------------------
*************************************************************************/
#ifndef _WSD_AL_IO_H_
#define _WSD_AL_IO_H_

#ifdef __cplusplus
extern "C" {
#endif

/***********************************************************************
*                                包含头文件
************************************************************************/


/***********************************************************************
*                                常量定义
***********************************************************************/
/******************************************************************
描述: 消息类型定义

成员:
	WSD_AL_IO_MSG_IR_E: 遥控器按键消息

	WSD_AL_IO_MSG_FP_E: 前面板按键消息

注意:
******************************************************************/
typedef enum _wsd_al_io_msg_e_
{
    WSD_AL_IO_MSG_IR_E,
    WSD_AL_IO_MSG_FP_E,
    WSD_AL_IO_MSG_MAX_E
}WSD_AL_IO_MSG_E;


/******************************************************************
描述: 面板按键定义

成员:
	WSD_AL_FP_KEY_STANDBY_E: 待机键

注意:
******************************************************************/
typedef enum _wsd_al_fp_key_e_
{
    WSD_AL_FP_KEY_STANDBY_E = 0x1006
}WSD_AL_FP_KEY_E;


/******************************************************************
描述: 指示灯类型定义

成员:
	WSD_AL_IO_LED_POWER_E: 电源指示灯

	WSD_AL_IO_LED_NET_E: 网络指示灯

	WSD_AL_IO_LED_SATA_E: 硬盘指示灯

注意:
******************************************************************/
typedef enum _wsd_al_io_led_e_
{
    WSD_AL_IO_LED_POWER_E,
    WSD_AL_IO_LED_NET_E,
    WSD_AL_IO_LED_SATA_E,
    WSD_AL_IO_LED_MAX_E
}WSD_AL_IO_LED_E;


/***********************************************************************
*                                全局宏定义
***********************************************************************/


/***********************************************************************
*                                全局数据结构定义
***********************************************************************/
/******************************************************************
描  述: 消息回调函数定义

参  数:
    msg(in): 消息类型
    param1(in): 消息参数一，表示按键的键值，包含系统码
    param2(in): 消息参数二，预留使用
    param3(in): 消息参数三，预留使用

返回值:
    D_SUCCESS: 成功
    D_FAILURE: 失败

注  意:
******************************************************************/
typedef D_INT32 (*WSD_AL_IO_NOTIFY)(WSD_AL_IO_MSG_E Msg, D_INT32 Param1 , D_INT32 Param2, D_INT32 Param3);


/***********************************************************************
*                                导出函数
***********************************************************************/
/******************************************************************
函数原型: WSD_AL_IO_Init

功能描述: 遥控器及面板初始化函数

参    数: 无

返 回 值:
    D_SUCCESS: 成功
    D_FAILURE: 失败

注    意:
******************************************************************/
D_INT32 WSD_AL_IO_Init(D_VOID);


/******************************************************************
函数原型: WSD_AL_IO_UnInit

功能描述: 遥控器及面板去初始化函数

参    数: 无

返 回 值:
    D_SUCCESS: 成功
    D_FAILURE: 失败

注    意:
******************************************************************/
D_INT32 WSD_AL_IO_UnInit(D_VOID);


/******************************************************************
函数原型: WSD_AL_IO_SetKeyFunc

功能描述: 设置遥控器及面板按键回调函数

参    数:
    pNotify(in): 遥控器及面板按键回调函数，此参数为NULL时，表示不通知应用按键消息

返 回 值:
    D_SUCCESS: 成功
    D_FAILURE: 失败

注    意:
******************************************************************/
D_INT32 WSD_AL_IO_SetNotify(WSD_AL_IO_NOTIFY pNotify);


/******************************************************************
函数原型: WSD_AL_IO_SetLed

功能描述: 指示灯控制函数

参    数:
    Led(in): 指示灯类型
    On(in):  指示灯开关控制

返 回 值:
    D_SUCCESS: 成功
    D_FAILURE: 失败

注    意:
******************************************************************/
D_INT32 WSD_AL_IO_SetLed(WSD_AL_IO_LED_E Led, D_BOOL On);


/******************************************************************
函数原型: WSD_AL_IO_EnterStandby

功能描述: 面板真待机处理

参    数: 无

返 回 值:
    D_SUCCESS: 成功
    D_FAILURE: 失败

注    意:
******************************************************************/
D_INT32 WSD_AL_IO_EnterStandby(D_VOID);

/******************************************************************
函数原型: WSD_AL_IO_SetSataPower

功能描述: SATA硬盘电源控制函数

参    数:
    On(in):  SATA硬盘电源开关控制，1:开，0:关

返 回 值:
    D_SUCCESS: 成功
    D_FAILURE: 失败

注    意:
******************************************************************/

D_INT32 WSD_AL_IO_SetSataPower(D_BOOL On);

/******************************************************************
函数原型: WSD_AL_IO_SetGpio

功能描述: GPIO引脚控制函数

参    数:
    GpioId(in): GPIO引脚编号
    Volt(in):  电平高或者低

返 回 值:
    D_SUCCESS: 成功
    D_FAILURE: 失败

注    意:
******************************************************************/
D_INT32 WSD_AL_IO_SetGpio(D_UINT32 GpioId, D_BOOL Volt);

#ifdef __cplusplus
}
#endif

#endif
