/*************************************************************************
                             All Rights Reserved
                                 R&D Dept.
*************************************************************************/


/*************************************************************************

Filename:       damd_porting_i2c.h

Description:    I2C读写控制函数

Author:         

Date:            

Modify Log:      
 ------------------------------------------------------------------------
1.
 修改人  :                           
 修改时间:
 修改原因:
 修改方法:
 ------------------------------------------------------------------------
2.
 修改人  :                           
 修改时间:
 修改原因:
 修改方法:
 ------------------------------------------------------------------------
*************************************************************************/
#ifndef _WSD_AL_I2C_H_
#define _WSD_AL_I2C_H_

#ifdef __cplusplus
extern "C" {
#endif

/***********************************************************************
*                                包含头文件
************************************************************************/


/***********************************************************************
*                                常量定义
***********************************************************************/


/***********************************************************************
*                                全局宏定义
***********************************************************************/


/***********************************************************************
*                                全局数据结构定义
***********************************************************************/


/***********************************************************************
*                                导出函数
***********************************************************************/
/******************************************************************
函数原型: WSD_AL_I2C_Init

功能描述: I2C初始化函数

参    数: 无

返 回 值:  
	D_SUCCESS: 成功
	D_FAILURE: 失败
	
注    意: 
******************************************************************/
D_INT32 WSD_AL_I2C_Init(D_VOID);


/******************************************************************
函数原型: WSD_AL_I2C_Write

功能描述: I2C写数据函数

参    数:
    Index(in)  : I2C总线索引值，范围【0,3】
    DevAddr(in): 设备地址
    SubAddr(in): 子寄存器地址
    pData(in)  : 写入数据地址
    DataLen(in): 写入长度

返 回 值:  
    D_SUCCESS: 成功
    D_FAILURE: 失败
    
注    意: 
******************************************************************/
D_INT32 WSD_AL_I2C_Write(D_UINT8 Index, D_UINT16 DevAddr, D_UINT8 SubAddr, D_UINT8 *pData, D_UINT32 DataLen);


/******************************************************************
函数原型: WSD_AL_I2C_Read

功能描述: I2C读数据函数

参    数:
    Index(in)  : I2C总线索引值，范围【0,3】
    DevAddr(in): 设备地址
    SubAddr(in): 子寄存器地址
    pData(out) : 数据地址，用于保存读出的数据
    DataLen(in): 读取的长度

返 回 值:  
    D_SUCCESS: 成功
    D_FAILURE: 失败
    
注    意: 
******************************************************************/
D_INT32 WSD_AL_I2C_Read(D_UINT8 Index, D_UINT16 DevAddr, D_UINT8 SubAddr, D_UINT8 *pData, D_UINT32 DataLen);


/******************************************************************
函数原型: WSD_AL_I2C_WriteRead

功能描述: I2C写读数据函数

参    数:
 Index(in)  : I2C总线索引值，范围【0,3】
 DevAddr(in): 设备地址
 SubAddr(in): 子寄存器地址
 pWriteData(in)  : 写入数据地址
 WriteDataLen(in): 写入长度
 pReadData(out)  : 数据地址，用于保存读出的数据
 ReadDataLen(in) : 读取的长度

返 回 值:  
    D_SUCCESS: 成功
    D_FAILURE: 失败
    
注    意: 
******************************************************************/
D_INT32 WSD_AL_I2C_WriteRead(D_UINT8 Index, D_UINT16 DevAddr, D_UINT8 SubAddr, D_UINT8 *pWriteData, D_UINT32 WriteDataLen, D_UINT8 *pReadData, D_UINT32 ReadDataLen);


#ifdef __cplusplus
}
#endif

#endif
